{
  "architectures": [
    "BertForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "label_0",
    "1": "label_1",
    "2": "label_2",
    "3": "label_3",
    "4": "label_4",
    "5": "label_5",
    "6": "label_6",
    "7": "label_7",
    "8": "label_8",
    "9": "label_9"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "label_0": 0,
    "label_1": 1,
    "label_2": 2,
    "label_3": 3,
    "label_4": 4,
    "label_5": 5,
    "label_6": 6,
    "label_7": 7,
    "label_8": 8,
    "label_9": 9
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 32000
}
